Repository: CofficLab/Lumi
Catalog: Packages/PluginACP/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A JSON-RPC response with protocolVersion 1 and agentInfo.name "lumi-acp" means the handshake succeeded.
zh_hans: 若返回 protocolVersion 为 1 且 agentInfo.name 为 "lumi-acp" 的 JSON-RPC 响应，即表示握手成功。
zh_hk: 若回傳 protocolVersion 為 1 且 agentInfo.name 為 "lumi-acp" 的 JSON-RPC 回應，即表示握手成功。

source: A model and API key configured in Lumi — the headless process reuses the app's Keychain.
zh_hans: 已在 Lumi 中配置模型与 API 密钥（headless 进程会复用应用的钥匙串）。
zh_hk: 已在 Lumi 中設定模型與 API 金鑰（headless 程序會複用應用程式的鑰匙圈）。

source: ACP executable path
zh_hans: ACP 可执行文件路径
zh_hk: ACP 可執行檔路徑

source: ACP lets supported editors (VS Code, Zed, and more) run Lumi as their built-in coding agent over stdio, reusing Lumi's model routing, tool system, and project intelligence.
zh_hans: Agent Client Protocol（ACP）让支持该协议的编辑器（VS Code、Zed 等）通过 stdio 把 Lumi 作为内置编码 agent 使用，并复用 Lumi 的模型路由、工具系统与项目智能。
zh_hk: Agent Client Protocol（ACP）讓支援該協議的編輯器（VS Code、Zed 等）透過 stdio 把 Lumi 作為內建編碼 agent 使用，並複用 Lumi 的模型路由、工具系統與專案智能。

source: Add a custom agent
zh_hans: 添加自定义 agent
zh_hk: 新增自訂 agent

source: Add an agent
zh_hans: 添加 agent
zh_hk: 新增 agent

source: Add the following to agent_servers in settings.json, replacing the command path with your ACPBootstrap path:
zh_hans: 在 settings.json 的 agent_servers 中添加以下配置，将 command 路径替换为你的 ACPBootstrap 路径：
zh_hk: 在 settings.json 的 agent_servers 中新增以下配置，將 command 路徑取代為你的 ACPBootstrap 路徑：

source: Add the following to agent_servers in settings.json, replacing the command with the lumi-acp path copied from Lumi settings:
zh_hans: 在 settings.json 的 agent_servers 中添加以下配置，将 command 替换为从 Lumi 设置复制的 lumi-acp 路径：
zh_hk: 在 settings.json 的 agent_servers 中新增以下配置，將 command 取代為從 Lumi 設定複製的 lumi-acp 路徑：

source: Allow
zh_hans: 允许
zh_hk: 允許

source: Allow this operation?
zh_hans: 是否允许执行该操作？
zh_hk: 是否允許執行此操作？

source: Build the headless entry point
zh_hans: 构建 headless 入口
zh_hk: 建置 headless 入口

source: Build the Lumi ACP headless entry point first (see Steps above).
zh_hans: 先构建 Lumi ACP headless 入口（见上方步骤）。
zh_hk: 先建置 Lumi ACP headless 入口（見上方步驟）。

source: Click Add Agent, then choose Add Custom Agent.
zh_hans: 点击 Add Agent，然后选择 Add Custom Agent。
zh_hk: 點擊 Add Agent，然後選擇 Add Custom Agent。

source: Click Add, then choose the agent in a new conversation.
zh_hans: 点击 Add，然后在新对话中选择该 agent。
zh_hk: 點擊 Add，然後在新對話中選擇該 agent。

source: Click Add, then choose the agent in a new conversation. Xcode 27 is in beta; ACP integration is early.
zh_hans: 点击 Add，然后在新对话中选择该 agent。Xcode 27 处于 Beta 阶段，ACP 集成尚在早期。
zh_hk: 點擊 Add，然後在新對話中選擇該 agent。Xcode 27 處於 Beta 階段，ACP 整合尚在早期。

source: Configure the agent server
zh_hans: 配置 agent 服务器
zh_hk: 配置 agent 伺服器

source: Connect Lumi to external editors
zh_hans: 将 Lumi 接入外部编辑器
zh_hk: 將 Lumi 接入外部編輯器

source: Copied
zh_hans: 已复制
zh_hk: 已複製

source: Copy ACP path
zh_hans: 复制 ACP 路径
zh_hk: 複製 ACP 路徑

source: Create a new ACP session in the editor and send a prompt. Lumi runs the turn and streams updates back to the editor.
zh_hans: 在编辑器中创建新的 ACP 会话并发送提示。Lumi 会执行回合并将更新流式回编辑器。
zh_hk: 在編輯器中建立新的 ACP 會話並發送提示。Lumi 會執行回合並將更新串流回編輯器。

source: Done
zh_hans: 完成
zh_hk: 完成

source: In any editor with Agent Client Protocol support, set the agent command to the path above. When the embedded agent ships inside Lumi.app, use /Applications/Lumi.app/Contents/MacOS/lumi-acp.
zh_hans: 在任何支持 Agent Client Protocol 的编辑器中，将 agent 命令设为上述路径。当 Lumi.app 内嵌 agent 正式发布后，请改用 /Applications/Lumi.app/Contents/MacOS/lumi-acp。
zh_hk: 在任何支援 Agent Client Protocol 的編輯器中，將 agent 指令設為上述路徑。當 Lumi.app 內嵌 agent 正式發佈後，請改用 /Applications/Lumi.app/Contents/MacOS/lumi-acp。

source: In the Lumi repository run:
zh_hans: 在 Lumi 仓库中运行：
zh_hk: 在 Lumi 倉庫中執行：

source: In Xcode, choose Xcode > Settings, then select Intelligence.
zh_hans: 在 Xcode 中，选择 Xcode > Settings，然后选择 Intelligence。
zh_hk: 在 Xcode 中，選擇 Xcode > Settings，然後選擇 Intelligence。

source: Input required: %@
zh_hans: 需要你的输入：%@
zh_hk: 需要你的輸入：%@

source: macOS 14 or later.
zh_hans: macOS 14 或更高版本。
zh_hk: macOS 14 或更高版本。

source: Next
zh_hans: 下一步
zh_hk: 下一步

source: No
zh_hans: 否
zh_hk: 否

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Open agent settings
zh_hans: 打开 agent 设置
zh_hk: 打開 agent 設定

source: Open Intelligence settings
zh_hans: 打开 Intelligence 设置
zh_hk: 打開 Intelligence 設定

source: Open the Agent Panel, start a new thread, and select Lumi.
zh_hans: 打开 Agent Panel，新建 thread，选择 Lumi。
zh_hk: 打開 Agent Panel，新建 thread，選擇 Lumi。

source: Open the command palette (Cmd+Shift+P), search for and run "agent: open settings".
zh_hans: 打开命令面板（Cmd+Shift+P），搜索并运行 "agent: open settings"。
zh_hk: 打開命令面板（Cmd+Shift+P），搜尋並執行 "agent: open settings"。

source: Point to the Lumi binary
zh_hans: 指向 Lumi 二进制
zh_hk: 指向 Lumi 二進位檔

source: Point your editor at the binary
zh_hans: 将编辑器指向该可执行文件
zh_hk: 將編輯器指向該可執行檔

source: Prerequisites
zh_hans: 前提条件
zh_hk: 前提條件

source: Previous
zh_hans: 上一步
zh_hk: 上一步

source: Recent Zed release
zh_hans: 近期 Zed 版本
zh_hk: 近期 Zed 版本

source: Reject
zh_hans: 拒绝
zh_hk: 拒絕

source: Set Executable to the ACPBootstrap binary path; leave Arguments empty.
zh_hans: 将 Executable 设为 ACPBootstrap 二进制路径，Arguments 留空。
zh_hk: 將 Executable 設為 ACPBootstrap 二進位檔路徑，Arguments 留空。

source: Set Executable to the lumi-acp path copied from Lumi settings; leave Arguments empty.
zh_hans: 将 Executable 设为从 Lumi 设置复制的 lumi-acp 路径，Arguments 留空。
zh_hk: 將 Executable 設為從 Lumi 設定複製的 lumi-acp 路徑，Arguments 留空。

source: Show setup steps
zh_hans: 查看配置步骤
zh_hk: 檢視配置步驟

source: Start a conversation
zh_hans: 开始对话
zh_hk: 開始對話

source: Start using Lumi
zh_hans: 开始使用 Lumi
zh_hk: 開始使用 Lumi

source: Steps
zh_hans: 接入步骤
zh_hk: 接入步驟

source: The binary lands at Packages/ACPBootstrap/.build/debug/ACPBootstrap.
zh_hans: 产物位于 Packages/ACPBootstrap/.build/debug/ACPBootstrap。
zh_hk: 產物位於 Packages/ACPBootstrap/.build/debug/ACPBootstrap。

source: The Lumi app never auto-starts the ACP server — stdin belongs to the editor. Only the headless entry point serves the protocol.
zh_hans: Lumi 应用不会自动启动 ACP 服务器——stdin 属于编辑器，只有 headless 入口会提供该协议服务。
zh_hk: Lumi 應用程式不會自動啟動 ACP 伺服器——stdin 屬於編輯器，只有 headless 入口會提供該協定服務。

source: Tool approvals appear as permission prompts inside the editor.
zh_hans: 工具授权会以权限提示的形式显示在编辑器中。
zh_hk: 工具授權會以權限提示的形式顯示在編輯器中。

source: Under Agents, click Add an Agent.
zh_hans: 在 Agents 下，点击 Add an Agent。
zh_hk: 在 Agents 下，點擊 Add an Agent。

source: Use in your editor
zh_hans: 在编辑器中使用
zh_hk: 在編輯器中使用

source: Use Lumi as a coding agent inside Xcode via the Agent Client Protocol.
zh_hans: 通过 Agent Client Protocol 在 Xcode 中把 Lumi 用作编码 agent。
zh_hk: 透過 Agent Client Protocol 在 Xcode 中把 Lumi 用作編碼 agent。

source: Use Lumi as an external agent in Zed's Agent Panel via ACP.
zh_hans: 通过 ACP 在 Zed 的 Agent Panel 中把 Lumi 用作外部 agent。
zh_hk: 透過 ACP 在 Zed 的 Agent Panel 中把 Lumi 用作外部 agent。

source: Verify the connection
zh_hans: 验证连接
zh_hk: 驗證連線

source: What is ACP
zh_hans: 什么是 ACP
zh_hk: 什麼是 ACP

source: Xcode 27 is currently in beta; ACP integration is early and protocol compatibility may vary.
zh_hans: Xcode 27 目前处于 Beta 阶段，ACP 集成尚在早期，协议兼容性可能存在差异。
zh_hk: Xcode 27 目前處於 Beta 階段，ACP 整合尚在早期，協定相容性可能存在差異。

source: Xcode 27 or later (Xcode 26.6 has early ACP support).
zh_hans: Xcode 27 或更高版本（Xcode 26.6 有早期 ACP 支持）。
zh_hk: Xcode 27 或更高版本（Xcode 26.6 有早期 ACP 支援）。

source: Xcode Command Line Tools with swift available on PATH.
zh_hans: Xcode 命令行工具（PATH 中包含 swift）。
zh_hk: Xcode 命令列工具（PATH 中包含 swift）。

source: Yes
zh_hans: 是
zh_hk: 是
